##  Content

* #### **Identify and handle missing values**;
* #### **Data formatting**;
* #### **Data normalization (centering/scaling)**;
* #### **Data binning**;
* #### **Turning Categorial values to numerical variables**.

In [1]:
import pandas as pd

url = "https://archive.ics.uci.edu/ml/machine-learning-databases/autos/imports-85.data"

df = pd.read_csv(url, header = None) # none must be passed because there aren't headers in the dataset
headers = ["symbolic", "normalized-losses", "make", "fuel-type", "aspiration", "num-of-doors", "body-style", "drive-wheels", "engine-location", "wheel-base", "length", "width", "height", "curb-weight", "engine-type", "num-of-cylinders", "engine-size", "fuel-system", "bore", "stroke", "compression-ratio", "horsepower", "peak-rpm", "city-mpg", "highway-mpg","price"]
df.columns = headers

In [2]:
#Simple Dataframe Operations

df.head(2)

,symbolic,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500

In [3]:
#Acessing a column of the dataframe

df["symbolic"] = df["symbolic"] +1 
df.head(2)

,symbolic,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,4,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,4,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500

### Dealing with missing values

**Drop The missing values**;
* Drop the variable
* Drop the data entry

**Replace the missing values**;

* replace it with an average (of similiar datapoints)
* replace it by frequency
* replace it based on other functions

**Leave it as missing data**.

In [4]:
# The dropna fuction to drop values like NaN. By specifying "axis=0" it drops the row, while "axis=1" 
#drops the columns that contain missing values.

#Since we want to predict the price of the cars, we have
#to remove the cars which doesnt  have a listed price.

#subset defines in which column the search will be done
#inplace = True modify the dataframe.
df.dropna(subset = ["price"], axis=0, inplace = True)

df["price"]

0      13495
1      16500
2      16500
3      13950
4      17450
       ...
200    16845
201    19045
202    21485
203    22470
204    22625
Name: price, Length: 205, dtype: object

In [5]:
import numpy as np 
#Replacing NaN values with newly calculated values

#For example, we want to replace the missing values of the
# variable "normalized losses" by the mean of the variable.
#So, we do:

mean = df["normalized-losses"][3:4].mean()

df["normalized-losses"].replace(mean)

0        ?
1        ?
2        ?
3      164
4      164
      ...
200     95
201     95
202     95
203     95
204     95
Name: normalized-losses, Length: 205, dtype: object

###  Wrapping up

In [6]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [7]:
df.dropna(subset = ["toy"], axis = 0) #drop the row with toy NaN or NaT

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [8]:
df.dropna(axis = 1) # drop all the columns with NaN or NaT

       name
0    Alfred
1    Batman
2  Catwoman

In [9]:
df.dropna(subset = ["born"], axis = 0)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [10]:
#Up there, there's no inĺace, so the dataframe wasn't modified:

In [11]:
#Modifying it: 
#subset specifies wich columns the fuction will look for missing values

df.dropna(subset=['toy', 'born'], axis = 0, inplace = True)
df

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [12]:
df = pd.DataFrame({"Price": [10, np.nan, 10, 40],
      "Length":[0.1, 0.3, np.nan, 0.1],
      "Sales": [100, 120, 200, np.nan]
     })

df

   Price  Length  Sales
0   10.0     0.1  100.0
1    NaN     0.3  120.0
2   10.0     NaN  200.0
3   40.0     0.1    NaN

In [13]:
mean = df["Price"].mean()
df["Price"].replace(np.nan, mean, inplace = True)
df

   Price  Length  Sales
0   10.0     0.1  100.0
1   20.0     0.3  120.0
2   10.0     NaN  200.0
3   40.0     0.1    NaN

#### Data Formating

In a survey, for example, people can describe their living city in different formats: Ny,NY, New York, new york and so on. In a dataset, in that case, it is useful to padronize (or format) the values so the analisys get easier. It's commom perform conversions between data tymes and numerical patterns too.

In [24]:
#Considering the feature named city-mpg which refers to the car fuel
#consumption in miles per gallon unit. If someone lives in a country
#that uses the metric units, it's reasonable perform the conversion between units.

df = pd.DataFrame({"city-mpg": [21,21,10,20,18,20,26]})
df.rename(columns = {"city-mpg": "city-L/100km"}, inplace = True)
df

   city-L/100km
0            21
1            21
2            10
3            20
4            18
5            20
6            26

##### Converting Data Types

In [32]:
#First, we identify the data types:

df.dtypes

city-L/100km    int64
dtype: object

In [33]:
df["city-L/100km"].astype("int", inplace = True)

0    21
1    21
2    10
3    20
4    18
5    20
6    26
Name: city-L/100km, dtype: int64

### Basics of Normalization 

Several approaches for normalization:

* Simple Feature scaling

$$ x_{new} = \frac{x_{old}}{x_{max}} $$ 

* Min-Max

$$ x_{new} = \frac{x_{old} - x_{min}}{{x_{max} - x_{min}}} $$

* Z_score

$$x_{new} = \frac{x_{old} - \mu}{\sigma}$$

where $\mu$ is the average of the feature and the $\sigma$ is the standart deviation.

In [99]:
norm_df = pd.DataFrame({"length":  [168.8,168.8, 180.0, 178.0, 165.2],
                   "width":   [64.1, 64.1, 65.6, 80.0, 30.0],
                   "height":  [48.8, 48.8, 52.4, 60.8, 80.7]})

In [75]:
norm_df

   length  width  height
0   168.8   64.1    48.8
1   168.8   64.1    48.8
2   180.0   65.6    52.4
3   178.0   80.0    60.8
4   165.2   30.0    80.7

In [102]:
#Applying the simple feature scaling

norm_df["length"] = norm_df["length"]/norm_df["length"].max()
norm_df["length"].max()

norm_df

     length  width  height
0  0.937778  0.682    48.8
1  0.937778  0.682    48.8
2  1.000000  0.712    52.4
3  0.988889  1.000    60.8
4  0.917778  0.000    80.7

In [103]:
#Applying the min-max method

norm_df["width"] = ((norm_df["width"] - norm_df["width"].min())/(norm_df["width"].max() - norm_df["width"].min()))
norm_df

     length  width  height
0  0.937778  0.682    48.8
1  0.937778  0.682    48.8
2  1.000000  0.712    52.4
3  0.988889  1.000    60.8
4  0.917778  0.000    80.7

In [106]:
#Applying the z_score

norm_df["height"] = (norm_df["height"] -norm_df["height"].mean())/norm_df["height"].std()

norm_df

     length  width    height
0  0.937778  0.682 -0.706461
1  0.937778  0.682 -0.706461
2  1.000000  0.712 -0.438750
3  0.988889  1.000  0.185911
4  0.917778  0.000  1.665761

### Binning: converting numbers into categorical values